Revit 2024 API
BuiltInFailures.PathOfTravelFailures.UpdateFailureMultiple Property
 [Number] Path of Travel lines failed to update. [Reason for failure]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UpdateFailureMultiple { get; }
Visual Basic
Public Shared ReadOnly Property UpdateFailureMultiple As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UpdateFailureMultiple {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PathOfTravelFailures Class
Autodesk.Revit.DB Namespace